lvx/base/Documents/бит_ПакетЭтаповНаРаскрой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ПакетЭтаповНаРаскрой</Name>
			<Comment>ЛТ6.15</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВыгрузкиФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроизводственныеЭтапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаПроизводство</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроизводства</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураВыходногоИзделия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаВыходногоИзделия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заготовки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БукваРаскроя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Метраж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураГП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаГП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыРаскроя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Documents/бит_ПакетЭтаповНаРаскрой/Ext/ManagerModule.bsl
Функция ПолучитьНастройкуПоУмолчанию(Знач ИмяНастройки, Знач ТолькоПервое = Ложь)
	
	Возврат Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию[ИмяНастройки], , ТолькоПервое);

КонецФункции

Функция БазисРаскрой_ВыгрузитьЗаказ(ДокПакет) Экспорт
	
	Разделитель = Символы.Таб;
	СвойствоТолщина 	= ПолучитьНастройкуПоУмолчанию("РеквизитХарактеристикиТолщинаМатериала");
	СвойствоВысота		= ПолучитьНастройкуПоУмолчанию("РеквизитХарактеристикиВысота");
	СвойствоШирина		= ПолучитьНастройкуПоУмолчанию("РеквизитХарактеристикиШирина");
	СвойствоОриентация	= ПолучитьНастройкуПоУмолчанию("РеквизитХарактеристикиОриентацияСтруктуры");
	
	мСвойствХарактеристик = Новый Массив;
	мСвойствХарактеристик.Добавить(СвойствоТолщина);
	мСвойствХарактеристик.Добавить(СвойствоВысота);
	мСвойствХарактеристик.Добавить(СвойствоШирина);
	мСвойствХарактеристик.Добавить(СвойствоОриентация);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокПакет", ДокПакет);
	Запрос.УстановитьПараметр("мСвойствХарактеристик", мСвойствХарактеристик);
	Запрос.УстановитьПараметр("СвойствоТолщина" , СвойствоТолщина);
	Запрос.УстановитьПараметр("СвойствоВысота"  , СвойствоВысота);
	Запрос.УстановитьПараметр("СвойствоШирина"  , СвойствоШирина);
	Запрос.УстановитьПараметр("СвойствоОриентация", СвойствоОриентация);

	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ПакетЭтаповНаРаскройМатериалыРаскроя.Номенклатура КАК Номенклатура,
	               |	бит_ПакетЭтаповНаРаскройМатериалыРаскроя.Характеристика КАК Характеристика,
	               |	бит_ПакетЭтаповНаРаскройМатериалыРаскроя.Количество КАК Количество,
	               |	бит_ПакетЭтаповНаРаскройМатериалыРаскроя.Упаковка КАК Упаковка
	               |ПОМЕСТИТЬ База
	               |ИЗ
	               |	Документ.бит_ПакетЭтаповНаРаскрой.МатериалыРаскроя КАК бит_ПакетЭтаповНаРаскройМатериалыРаскроя
	               |ГДЕ
	               |	бит_ПакетЭтаповНаРаскройМатериалыРаскроя.Ссылка = &ДокПакет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК Характеристика,
	               |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство КАК Свойство,
	               |	МАКСИМУМ(ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение) КАК Значение
	               |ПОМЕСТИТЬ втСвойстваХарактеристики
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	               |ГДЕ
	               |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка В
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				База.Характеристика
	               |			ИЗ
	               |				База КАК База)
	               |	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство В(&мСвойствХарактеристик)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка,
	               |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Характеристика,
	               |	Свойство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втСвойстваХарактеристикиТолщина.Значение КАК Толщина,
	               |	втСвойстваХарактеристикиВысота.Значение КАК Высота,
	               |	втСвойстваХарактеристикиШирина.Значение КАК Ширина,
	               |	ВЫБОР
	               |		КОГДА втСвойстваХарактеристикиОриентация.Значение ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ НЕ ВЫРАЗИТЬ(втСвойстваХарактеристикиОриентация.Значение КАК БУЛЕВО)
	               |	КОНЕЦ КАК Текстура,
	               |	База.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	База КАК База
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втСвойстваХарактеристики КАК втСвойстваХарактеристикиТолщина
	               |		ПО База.Характеристика = втСвойстваХарактеристикиТолщина.Характеристика
	               |			И (втСвойстваХарактеристикиТолщина.Свойство = &СвойствоТолщина)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втСвойстваХарактеристики КАК втСвойстваХарактеристикиВысота
	               |		ПО (База.Характеристика = втСвойстваХарактеристикиТолщина.Характеристика)
	               |			И (втСвойстваХарактеристикиТолщина.Свойство = &СвойствоВысота)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втСвойстваХарактеристики КАК втСвойстваХарактеристикиШирина
	               |		ПО База.Характеристика = втСвойстваХарактеристикиШирина.Характеристика
	               |			И (втСвойстваХарактеристикиТолщина.Свойство = &СвойствоШирина)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втСвойстваХарактеристики КАК втСвойстваХарактеристикиОриентация
	               |		ПО База.Характеристика = втСвойстваХарактеристикиОриентация.Характеристика
	               |			И (втСвойстваХарактеристикиОриентация.Свойство = &СвойствоОриентация)";	   
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	
	_ТаблицаМатериалов = ДокПакет.МатериалыРаскроя.Выгрузить(, "Номенклатура, ");
	_ТаблицаМатериалов.Свернуть("Номенклатура");
	//
	_ИмяНабораПанелей_БазисРаскрой 	= Обработки.бит_ФормированиеПакетовЗаказовНаПроизводство.ПолучитьИдентификатор_БазисРаскрой(ДокПакет);
	_ИмяНабораПанелей 				= _ИмяНабораПанелей_БазисРаскрой;
	//
	ТекстЗаказ = Новый ТекстовыйДокумент;
	ТекстЗаказ.ДобавитьСтроку("List of panels for cutting");
	ТекстЗаказ.ДобавитьСтроку("Version 8.0");
	ТекстЗаказ.ДобавитьСтроку("Заказ" + Разделитель +  _ИмяНабораПанелей);
	//
	//_Параметр_НеВращать = глЗначениеПоИД("Параметр_НеВращатьИзделие",, Ложь);
	//_Параметр_Обозначение	= глЗначениеПоИД("Параметр_Обозначение",, Ложь);
	//
	ТаблНоменклатураГП = ДокПакет.Заготовки.Выгрузить(,"НоменклатураГП,ХарактеристикаГП,БукваРаскроя");
	ТаблНоменклатураГП.Свернуть("НоменклатураГП,ХарактеристикаГП,БукваРаскроя");
	ТаблНоменклатураГП.Колонки.Добавить("Поз");
	Для Каждого СтрокаТаблНоменклатураГП Из ТаблНоменклатураГП Цикл
	//	//СтрокаТаблНоменклатураГП.Поз = ПС_ПолучитьПозСтрока(ТаблНоменклатураГП.Индекс(СтрокаТаблНоменклатураГП)+1);
		СтрокаТаблНоменклатураГП.Поз = СтрокаТаблНоменклатураГП.БукваРаскроя;//ПС_ПолучитьПозСтрока(ТаблНоменклатураГП.Индекс(СтрокаТаблНоменклатураГП)+1);
	КонецЦикла;
	//
	Для Каждого строка_ТаблицаМатериалов Из _ТаблицаМатериалов Цикл
	//	
	//	_СвойстваМатериалаРаскроя = строка_ТаблицаМатериалов.Номенклатура.НоменклатурнаяГруппа.СвойстваМатериалаРаскроя;
		 _СвойстваМатериалаРаскрояТолщина = "";
		_Строка 	= "Material" + Разделитель + строка_ТаблицаМатериалов.Номенклатура + Разделитель;
	//	//_ВидРаскроя = ?(глПустоеЗначение(ВидРаскроя), _СвойстваМатериалаРаскроя.ВидРаскроя, ВидРаскроя);
		//_Строка 	= _Строка + ?(_ВидРаскроя = Перечисления.ВидыРаскроя.Одномерный, "Stripe", "Slab");   
		_Строка 	= _Строка + "Slab";
		_Строка 	= _Строка + Разделитель + строка_ТаблицаМатериалов.Номенклатура.Артикул + разделитель + _СвойстваМатериалаРаскрояТолщина;
		ТекстЗаказ.ДобавитьСтроку(_Строка);
	//	
	//	стру_ОтборМатериал = Новый Структура();
	//	стру_ОтборМатериал.Вставить("Раскрой_Материал", строка_ТаблицаМатериалов.Номенклатура);
	//	
	//	_ТаблицаЗаготовокПоМатериалу = ТЧЗаготовки.Выгрузить(стру_ОтборМатериал);
	//	
	//	_Сч = 0;
	//	Для Каждого строка_ТаблЗаготовки Из _ТаблицаЗаготовокПоМатериалу Цикл
	//		
	//		_ЗначениеНеВращать = Ложь;
	//		Если НЕ глПустоеЗначение(_Параметр_НеВращать) Тогда 
	//			_ЗначениеНеВращать = глПолучитьЗначениеПараметраВИ(строка_ТаблЗаготовки.ВариантИсполнения, _Параметр_НеВращать);
	//			//По умолчанию Ориентация=Ложь (ТекстураЗадана=Ложь) то есть можно этот деталь крутить при раскрое как хочешь.
	//			//В спецификации тоже оформляется на деталь по умолчанию ложь. Но что бы на каждый деталь не указать Ориентация = Истина.
	//			//а на некоторых к примеру для ящика не обязятельно ориентацию фиксировать для них в спецификации индивидуально ставится.
	//			//Итог Ориентация = ИСТИНА выгружаем  ТекстураЗадана=ЛОЖЬ
	//			//а Ориентация = ЛОЖЬ выгружаем  ТекстураЗадана=ИСТИНА
	//			//_ЗначениеНеВращать = ?(_ЗначениеНеВращать = Неопределено, Ложь, _ЗначениеНеВращать);
	//			_ЗначениеНеВращать = ?(_ЗначениеНеВращать = Неопределено, Ложь, НЕ _ЗначениеНеВращать);
	//			
	//		КонецЕсли;
	//		
	//		_ЗначениеОбозначение = "";
	//		Если НЕ глПустоеЗначение(_Параметр_Обозначение) Тогда 
	//			_ЗначениеОбозначение = глПолучитьЗначениеПараметраВИ(строка_ТаблЗаготовки.ВариантИсполнения, _Параметр_Обозначение);
	//			_ЗначениеОбозначение = ?(_ЗначениеОбозначение = Неопределено, "", _ЗначениеОбозначение);
	//		КонецЕсли;
	//		
	//		_Сч = _Сч + 1;
	//		
	//		//ПС__ 26.09.2024 Положий Виталий Вадимович
	//		_НаименованиеДетали = "[" + строка_ТаблЗаготовки.Номенклатура.Код + "]"  + строка_ТаблЗаготовки.Номенклатура 
	//								+ " " + строка_ТаблЗаготовки.ВариантИсполнения;
	//		//__ПС 26.09.2024 Положий Виталий Вадимович
	//		
	//		МассивПолей = Новый Массив;
	//		//ПС__ 27.09.2024 Положий Виталий Вадимович
	//		//МассивПолей.Добавить(Формат(_Сч, "ЧРД=,; ЧРГ=' '; ЧГ="));// 1 Позиция
	//		_Позиция = "";
	//		СтрокаТаблНоменклатураГП =  ТаблНоменклатураГП.Найти(строка_ТаблЗаготовки.ВариантИсполненияГП, "ВариантИсполненияГП");
	//		Если Не СтрокаТаблНоменклатураГП = Неопределено Тогда
	//			_Позиция = СтрокаТаблНоменклатураГП.Поз;	
	//		КонецЕсли;
	//		МассивПолей.Добавить(""+_Позиция+"/"+Формат(_Сч, "ЧРД=,; ЧРГ=' '; ЧГ="));// 1 Позиция
	//		//__ПС 27.09.2024 Положий Виталий Вадимович
	//		МассивПолей.Добавить(Формат(строка_ТаблЗаготовки.ВариантИсполнения.Раскрой_Длина, "ЧРД=,; ЧРГ=' '; ЧГ="));//2 Длина  
	//		МассивПолей.Добавить(Формат(строка_ТаблЗаготовки.ВариантИсполнения.Раскрой_Ширина, "ЧРД=,; ЧРГ=' '; ЧГ="));//3 Ширина
	//		МассивПолей.Добавить(Формат(строка_ТаблЗаготовки.Кол, "ЧРД=,; ЧРГ=' '; ЧГ=")); //4 Количество 
	//		МассивПолей.Добавить(?(_ЗначениеНеВращать, "", "Не задана"));//5 Ориентация
	//		//ПС__ 26.09.2024 Положий Виталий Вадимович
	//		//МассивПолей.Добавить("[" + строка_ТаблЗаготовки.Номенклатура.Код + "]"  + строка_ТаблЗаготовки.Номенклатура 
	//		//						+ " " + строка_ТаблЗаготовки.ВариантИсполнения); //6 Наименование
	//		МассивПолей.Добавить(ПС_ПолучитьНаименованиеДеталиБазис(строка_ТаблЗаготовки)); //6 Наименование
	//		//__ПС 26.09.2024 Положий Виталий Вадимович
	//		МассивПолей.Добавить("1"); //7 Кроить
	//		МассивПолей.Добавить(" "); //8 Наименование кромки 1
	//		МассивПолей.Добавить(" "); //9 Обозначение кромки 1
	//		МассивПолей.Добавить(" "); //10 Толщина 1
	//		МассивПолей.Добавить(" "); //11 Наименование кромки 2
	//		МассивПолей.Добавить(" "); //12 Обозначение кромки 2
	//		МассивПолей.Добавить(" "); //13 Толщина 2
	//		МассивПолей.Добавить(" "); //14 Наименование кромки 3
	//		МассивПолей.Добавить(" "); //15 Обозначение кромки 3
	//		МассивПолей.Добавить(" "); //16 Толщина 3
	//		МассивПолей.Добавить(" "); //17 Наименование кромки 4
	//		МассивПолей.Добавить(" "); //18 Обозначение кромки 4
	//		МассивПолей.Добавить(" "); //19 Толщина 4
	//		МассивПолей.Добавить(" "); //20 Обозначение пазов
	//		МассивПолей.Добавить(" "); //21 Имя модели
	//		МассивПолей.Добавить(" "); //22 Артикул модели
	//		МассивПолей.Добавить(" "); //23 Приоритет 
	//		//ПС__ 26.09.2024 Положий Виталий Вадимович
	//		//МассивПолей.Добавить(" "); //24 Комментарий
	//		МассивПолей.Добавить(_НаименованиеДетали); //24 Комментарий
	//		//__ПС 26.09.2024 Положий Виталий Вадимович
	//		МассивПолей.Добавить(" "); //25 Облицовка
	//		МассивПолей.Добавить(Строка(_ЗначениеОбозначение)); //26 ID детали
	//		МассивПолей.Добавить(" "); //27 Свес кромки L1
	//		МассивПолей.Добавить(" "); //28 Свес кромки W1
	//		МассивПолей.Добавить(" "); //29 Свес кромки L2
	//		МассивПолей.Добавить(" "); //30 Свес кромки W2
	//		МассивПолей.Добавить(" "); //31 Припуск L1
	//		МассивПолей.Добавить(" "); //32 Припуск W1
	//		МассивПолей.Добавить(" "); //33 Припуск L2
	//		МассивПолей.Добавить(" "); //34 Припуск W2
	//		
	//		//_Строка = Формат(_Сч, "ЧРД=,; ЧРГ=' '; ЧГ=") + "	"
	//		//					+ Формат(строка_ТаблЗаготовки.ВариантИсполнения.Раскрой_Длина, "ЧРД=,; ЧРГ=' '; ЧГ=") + "	"
	//		//					+ Формат(строка_ТаблЗаготовки.ВариантИсполнения.Раскрой_Ширина, "ЧРД=,; ЧРГ=' '; ЧГ=") + "	"
	//		//					+ Формат(строка_ТаблЗаготовки.Кол, "ЧРД=,; ЧРГ=' '; ЧГ=") + "	"
	//		//					+ ?(_ЗначениеНеВращать, "", "Не задана") + "	"
	//		//					+ "[" + строка_ТаблЗаготовки.Номенклатура.Код + "]"  + строка_ТаблЗаготовки.Номенклатура + " " 
	//		//					+ строка_ТаблЗаготовки.ВариантИсполнения + "	"
	//		//					+ "1" + "	"
	//		//					+ "																				";
	//		
	//		_Строка = "";
	//		Для Каждого ПолеФормата Из МассивПолей Цикл
	//			_Строка = _Строка + ПолеФормата + "	" ; // TAB
	//		КонецЦикла;			
	//		
			ТекстЗаказ.ДобавитьСтроку(_Строка);
	//		
		КонецЦикла;
		
	//КонецЦикла;
	//
	_ИмяФайла = СтрЗаменить(ДокПакет.АдресВыгрузкиФайла + "\" + _ИмяНабораПанелей +".obl","\","/");
	_ИмяФайла = СтрЗаменить(_ИмяФайла, "//", "/");
	
	ТекстЗаказ.Записать(_ИмяФайла, КодировкаТекста.ANSI);
	//
	Возврат _ИмяНабораПанелей;
	//
КонецФункции    

Функция ПС_ПолучитьНаименованиеДеталиБазис(ВхСтрокаЗаготовка)
	
	////ПС__ 26.09.2024 Положий Виталий Вадимович
	//Возврат "[" + ВхСтрокаЗаготовка.НоменклатураГП.Код + "]"  + ВхСтрокаЗаготовка.НоменклатураГП 
	//								+ " " + ВхСтрокаЗаготовка.ВариантИсполненияГП
	//								+ "["+ Формат(ВхСтрокаЗаготовка.Номенклатура.Код, "ЧГ=0") + "/" + Формат(ВхСтрокаЗаготовка.ВариантИсполнения.Код, "ЧГ=0") + "]";
	////__ПС 26.09.2024 Положий Виталий Вадимович
	
КонецФункции    

// Получает значение параметра ВИ.
// Вместо варианта исполнения понимает структуры
//   - глПолучитьСтруктуруПараметровВИ()
//   - глПолучитьСтруктуруПараметровВИ()
//
// Параметры:
//  ВхВариантИсп_Объект	 - ВИОбъект, структура	 - 
//  ВхПараметр			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция глПолучитьЗначениеПараметраВИ(ВхВариантИсп_Объект, ВхПараметр) Экспорт

	//Если глПустоеЗначение(ВхВариантИсп_Объект) Тогда
	//	//_ТекстОшибки = "Не указан ВИ";
	//	Возврат Неопределено;
	//КонецЕсли;
	//
	//_БазовыйВИ = ?(ВхВариантИсп_Объект.ЭтоСлужебныйПолуфабрикат, ВхВариантИсп_Объект.БазовыйВариантИсполнения, ВхВариантИсп_Объект);
	//
	//Если ТипЗнч(ВхПараметр) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
	//	
	//	строка_ТЧПараметры = _БазовыйВИ.ТЧПараметры.Найти(ВхПараметр, "Параметр");
	//	Если строка_ТЧПараметры = Неопределено Тогда
	//		//_ТекстОшибки = "Параметр отсутствует у ВИ";
	//		Возврат Неопределено;
	//	КонецЕсли;
	//	
	//	Возврат строка_ТЧПараметры.ЗначениеПараметра;
	//	
	//ИначеЕсли ТипЗнч(ВхПараметр) = Тип("Строка") Тогда
	//	
	//	Если Лев(ВхПараметр, 8) = "Параметр" Тогда
	//		
	//		_Параметр = ПланыВидовХарактеристик.ПараметрыНоменклатуры.НайтиПоКоду(Сред(ВхПараметр, 9, 3));
	//		Если _Параметр = Неопределено Тогда
	//			//_ТекстОшибки = "Ошибка идентификации параметра";
	//			Возврат Неопределено;
	//		КонецЕсли;
	//		
	//		строка_ТЧПараметры = _БазовыйВИ.ТЧПараметры.Найти(_Параметр, "Параметр");
	//		Если строка_ТЧПараметры = Неопределено Тогда
	//			//_ТекстОшибки = "Параметр отсутствует у ВИ";
	//			Возврат Неопределено;
	//		КонецЕсли;
	//		
	//		Возврат строка_ТЧПараметры.ЗначениеПараметра;
	//		
	//	Иначе
	//		
	//		_ИмяПараметра = СокрЛП(ВхПараметр);
	//		
	//		Попытка
	//			
	//			Возврат _БазовыйВИ[_ИмяПараметра];
	//			
	//		Исключение

	//			Возврат Неопределено;
	//			
	//		КонецПопытки
	//		
	//	КонецЕсли;
	//	
	//Иначе
	//	
	//	//_ТекстОшибки = "Недопустимый тип";
	//	Возврат Неопределено;
	//	
	//КонецЕсли;
	//
КонецФункции //

// Определяет заполнено ли переданное значение
//
// Параметры: 
//  Значение - значение, заполенение которого надо проверить
//
// Возвращаемое значение:
//  Истина - значение не заполнено, ложь - иначе.
//
Функция глПустоеЗначение(ВхЗначение) Экспорт

	// Сначала примитивные типы
	Если ВхЗначение = NULL 
		Тогда
		
		Возврат Истина;
		
	КонецЕсли;	

	ТипЗначения = ТипЗнч(ВхЗначение);

	Если ТипЗначения = Тип("Неопределено") Тогда
		
		Возврат ВхЗначение = Неопределено;
		
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		
		Возврат ПустаяСтрока(ВхЗначение);
		
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		
		Возврат ВхЗначение = 0;
		
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		
		Возврат Ложь; // Булево будем считать не пустым
		
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		
		Возврат ВхЗначение = '00010101'
			ИЛИ ВхЗначение = '00010101000000'; 
		
	ИначеЕсли ТипЗначения = Тип("СписокЗначений")
		ИЛИ ТипЗначения = Тип("Массив")
		ИЛИ ТипЗначения = Тип("ТаблицаЗначений")
		ИЛИ ТипЗначения = Тип("Структура")
		Тогда
		
		Возврат ВхЗначение.Количество() = 0;
		
	//Отдельное определение, так как конструкторов данного типа не существует	
	ИначеЕсли ТипЗначения = Тип("РежимПроведенияДокумента") Тогда
	
		Возврат НЕ ВхЗначение = РежимПроведенияДокумента.Неоперативный
				И НЕ ВхЗначение = РежимПроведенияДокумента.Оперативный;
		
	//Отдельное определение, так как конструкторов данного типа не существует	
	ИначеЕсли ТипЗначения = Тип("СтрокаДереваЗначений")
			ИЛИ ТипЗначения = Тип("СтрокаТаблицыЗначений")
			Тогда
			
			Возврат Ложь;
			
	//Отдельное определение, так как конструкторов данного типа не существует	
	ИначеЕсли ТипЗначения = Тип("МоментВремени")
			Тогда
			
			
			Возврат глПустоеЗначение(ВхЗначение.Дата) И глПустоеЗначение(ВхЗначение.Ссылка);
			
	// Для остальных будем считать значение пустым, если оно равно
	// дефолтному значению своего типа
	Иначе
		
		Попытка
			
			Возврат ВхЗначение = Новый(ТипЗначения);
			
		Исключение
			
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЕсли; 

КонецФункции // глПустоеЗначение()


//Получает Значение по переданному идентификатору ВхИД
//
// см. РегистрыСведений.ЗначенияПоИД.ПолучитьПоИД() 
//
Функция глЗначениеПоИД(ВхИД, ВхНужныйТип = Неопределено, ВхВыводитьСообщения = Истина) Экспорт
	
	_Значение = "";
	//РегистрыСведений.ЗначенияПоИД.ПолучитьПоИД(ВхИД, ВхНужныйТип, ВхВыводитьСообщения);
	
	Возврат _Значение;
	
КонецФункции
